{"pageContext":{"prev":null,"next":{"html":"<h2>Article Highlights</h2>\n<ul>\n<li>The live event is sold out but will be broadcast online and via satellite.</li>\n</ul>\n<h2>Related Links</h2>\n<ul>\n<li><a href=\"https://www.lds.org/topics/blacks-in-the-church?lang=eng&#x26;cid=rdb_v_beone\">Learn more at BeOne.lds.org.</a></li>\n<li><a href=\"https://www.lds.org/liahona/2018/06/commemorating-the-1978-revelation/extending-the-blessings-of-the-priesthood?lang=eng\">Read articles in Church magazines commemorating the 1978 revelation.</a></li>\n</ul>\n<hr>\n<p>The First Presidency has announced a special worldwide event to celebrate the 40th anniversary of the 1978 revelation on the priesthood and invites adults and children of all ages and backgrounds to watch the broadcast.</p>\n<p>The live event is sold out.</p>\n<p>\"Be One\" is the theme of the musical event, based on the Savior's admonition to \"be one; and if ye are not one ye are not mine\" (<a href=\"https://www.lds.org/scriptures/dc-testament/dc/38.27?lang=eng#26\">D&#x26;C 38:27</a>). It will feature messages from Church leaders and performances by Gladys Knight, Alex Boyé, the Bonner family, the Unity Gospel Choir International, and members of the Mormon Tabernacle Choir.</p>\n<h2>How to watch</h2>\n<p>View the live stream of the worldwide broadcast on Friday, June 1, 2018, at 7:30 p.m. (mountain daylight time). The broadcast will be live on the Church satellite system, <a href=\"https://www.lds.org/lds.org?lang=eng\">LDS.org</a>, <a href=\"https://www.mormontabernaclechoir.org/\">MoTab.org</a>, <a href=\"https://www.mormonchannel.org/\">mormonchannel.org</a>, <a href=\"https://www.facebook.com/LDS\">Facebook</a>, <a href=\"https://www.instagram.com/p/BhwIT63HczB/\">Instagram</a>, Mormon Channel for Roku, and the <a href=\"https://www.youtube.com/user/MormonMessages\">Mormon Channel on YouTube</a>.</p>\n<p>The broadcast will be available for on-demand viewing soon after on <a href=\"https://www.lds.org/broadcasts?lang=eng\">broadcasts.lds.org</a> in American Sign Language, English, Haitian, French, Portuguese, and Spanish, with additional languages added in the following weeks.</p>\n<p>Priesthood leaders should determine the viewing date and time that work best for the members in their area.</p>\n<p>Stake technology specialists</p>\n<p>Stake technology specialists should refer to the <a href=\"https://www.lds.org/letters?lang=eng&#x26;id=15713&#x26;inline=true&#x26;source=4\">broadcast schedule</a>.</p>\n<h2>A monumental day</h2>\n<p>Forty years ago, on a truly monumental day in the history of the Church and the world, President Spencer W. Kimball announced that the opportunity to receive all the blessings of the priesthood would be extended to all of God's children everywhere in the world. The revelation rescinded the restriction on priesthood ordination. It also extended the blessings of the temple to all worthy Latter-day Saints, men and women (see <a href=\"https://www.lds.org/scriptures/dc-testament/od/2?lang=eng\">Official Declaration 2</a>).</p>\n<p>While the June celebration will hail the history of black Mormon pioneers and reaffirm the reality that \"all are alike unto God\" (<a href=\"https://www.lds.org/scriptures/bofm/2-ne/26.33?lang=eng#32\">2 Nephi 26:33</a>) in His global family, the event is intended to be much more than a celebration. It will also be a renewal of our collective commitment to pursue oneness in our relationships with each other and with heaven.</p>\n<p>Although attitudes and choices such as anger, bigotry, racism, prejudice, and intolerance cause separation and division, fortunately, prophets have taught that \"a great day of unity is coming\" (\"<a href=\"https://www.lds.org/general-conference/2008/10/our-hearts-knit-as-one?lang=eng\">Our Hearts Knit as One</a>,\" Oct. 2008 general conference).</p>\n<p><img src=\"https://www.lds.org/bc/content/ldsorg/church/news/2018/05/02/620-london-nairobi-demonstrate-different-face-of-lds-church-duri_20.jpg\"></p>\n<p>President Russell M. Nelson and his wife, Wendy, are greeted by Latter-day Saints Mercy Makau and her family in Nairobi, Kenya, on his world tour, April 16, 2018.</p>\n<p>President <a href=\"https://www.lds.org/church/leader/m-russell-ballard?lang=eng\">M. Russell Ballard</a> said, \"We need to embrace God's children compassionately and eliminate any prejudice, including racism, sexism, and nationalism. Let it be said that we truly believe the blessings of the restored gospel of Jesus Christ are for every child of God\" (\"<a href=\"https://www.lds.org/general-conference/2017/10/the-trek-continues?lang=eng\">The Trek Continues</a>!\", Oct. 2017 general conference).</p>\n<p>Added Elder <a href=\"https://www.lds.org/church/leader/quentin-l-cook?lang=eng\">Quentin L. Cook</a>, \"Anyone who claims superiority under the Father's plan because of characteristics like race, sex, nationality, language, or economic circumstances is morally wrong and does not understand the Lord's true purpose for all of our Father's children\" (\"<a href=\"https://www.lds.org/general-conference/2017/10/the-eternal-everyday?lang=eng\">The Eternal Everyday</a>,\" Oct. 2017 general conference).</p>\n<p>Learn more at <a href=\"http://beone.lds.org/\">BeOne.lds.org</a>, which features a message from the First Presidency and stories of faith of Church members.</p>","id":"141760e2-6e5e-55c9-af98-3dec4a2557a0","frontmatter":{"date":"2018-06-07T12:34:00+00:00","path":"/news/be-one-celebration","title":"Watch “Be One” Celebration Event","excerpt":"Sacred music teaches the doctrines of the gospel, nourishes us spiritually, and has the power to unify Church members throughout the world. The Church has announced it is revising the hymnbook and children’s songbook and invites members to participate.","tags":["Events","Church Leaders","Music and Arts"],"image":"https://www.lds.org/bc/content/ldsorg/church/news/2018/05/02/580-RMN-Kenya4276-2018.jpg"}}}}