{"pageContext":{"posts":[{"html":"<p>The First Presidency announced in a <a href=\"https://www.lds.org/bc/content/ldsorg/church/news/2018/06/20/15790_000_letter.pdf?lang=eng\">letter</a> dated June 20 new guidelines for interviewing youth. In addition, the Church's official handbook of instructions has been updated.</p>\n<p>\"Bishops have a sacred responsibility to lead, teach, and inspire youth,\" according to a letter signed by the First Presidency and sent to general and local Church leaders.</p>\n<p>\"Effective personal interviews are one important way they do this. These interviews provide opportunities to help youth become disciples of the Savior, repent of transgressions, and live the gospel of Jesus Christ.\"</p>\n<p>Leaders who conduct interviews with youth should \"prepare themselves spiritually to be guided by the Holy Ghost\" and are encouraged \"to carefully review the guidelines for interviews and counseling,\" according to the letter.</p>\n<p>To help ensure that youth and parents are aware of the topics and questions covered in these interviews, bishops are instructed to share the updated guidelines with families before the first interview.</p>\n<p>The new guidelines will appear in Handbook 1, the policy guide for Latter-day Saint bishops and stake presidents. The chapter \"Guidelines for Youth Interviews\" will be updated in online resources for leaders, according to the letter.</p>\n<p>The guidelines apply to interviews with youth 12 and older. \"Generally, children younger than 11 are not interviewed except in preparation for baptism or to be sealed to their parents in the temple. These interviews are different in nature from youth interviews, and parents are typically present,\" according to the letter.</p>\n<p>According to the updates in <em>Handbook 1:</em> \"Parents have the primary responsibility for teaching their children the gospel of Jesus Christ. They help their children grow spiritually and prepare to make and keep sacred covenants. Parents also counsel with their children regarding worthiness and help them repent and improve. Bishops and other Church leaders support parents in these efforts,\" according to the Church's <em>Handbook 1</em>.</p>\n<p>The handbook instructs bishops to share with youth and parents the following information about interviews:</p>\n<ul>\n<li>Parents have the primary responsibility to teach and nurture their children.</li>\n<li>Typically, the bishop or one of his counselors will interview the young man or young woman at least twice a year for the reasons outlined in \"Purposes of Interviews\" below. A bishopric member may also meet with youth to answer questions, give support, or extend assignments.</li>\n<li>To help youth prepare spiritually, interviews are required for sacred matters such as temple recommends, priesthood ordinations, and mission calls. Leaders work with parents to help youth prepare for these interviews.</li>\n<li>Parents encourage their children to meet with the bishop when they need his help with spiritual guidance or with repentance.</li>\n<li>If a youth desires, he or she may invite a parent or another adult to be present when meeting with the bishop or one of his counselors.</li>\n</ul>\n<p>Key matters for discussion during these interviews \"include the growth of the young person's testimony of Heavenly Father, the mission and Atonement of Jesus Christ, and the restored gospel.\"</p>\n<p>The bishop and his counselors \"emphasize the importance of keeping baptismal covenants. They teach youth to prepare to make and keep temple covenants through daily righteous living. Bishopric members encourage youth to pray regularly in private and with their family and to study the scriptures. They also encourage youth to stay close to their parents.\"</p>","id":"f30841a6-7898-5be0-961c-74f502a796f0","frontmatter":{"date":"2018-06-15T12:34:00+00:00","path":"/news/new-guidelines-for-interviewing-youth","title":"First Presidency Releases New Guidelines for Interviewing Youth","excerpt":"Interviews provide opportunities to help youth become disciples of the Savior, repent of transgressions, and live the gospel of Jesus Christ.","tags":["Church Leaders","Youth"],"image":"https://www.lds.org/bc/content/ldsorg/church/news/2018/06/20/580-1560412-PS091115_cah_0073.jpg"}}],"tagName":"Church Leaders"}}