{"pageContext":{"posts":[{"html":"<p><img src=\"https://nerdist.com/wp-content/uploads/2016/05/REBIRTH-splash.jpg\" alt=\"Cover Image\"></p>\n<h1>Test Post</h1>\n<h3>May 23, 2018</h3>\n<p>The comic begins with an unseen narrator, talking about the Earth and how much he loves it. But as much as he loves it, he knows there’s something missing. Within a few pages, it’s revealed that the narrator of our story is none other than Wally West, the third Flash, one of DC’s most important characters who was all but erased in the New 52. For many fans, Wally became a symbol of everything the New 52 was against: he was a legacy character (“legacy” equals “bad,” as it shows characters had history, and therefore were older) and he was married with kids (also bad, as it shows characters happy and fulfilled, not to mention older). So his prominence in this comic is the first sign things are about to get back to normal.</p>\n<p><img src=\"https://nerdist.com/wp-content/uploads/2016/05/REB_1_dylux-low-2-720x1107-615x456.jpg\" alt=\"One\"></p>\n<p>Wally has been trapped in the Speed Force since the Flashpoint event that caused the New 52—the time rupture that happened when Flash Barry Allen went back in time and saved his mom from being murdered. This rewrote DC history into what we know as the New 52 continuity. The comics shows how Wally keeps trying to emerge from the Speed Force and set up an emotional anchor to keep him tethered in this reality, where everyone has seemingly forgotten him.</p>\n<p>He tries first with Batman, in a scene that echoes the classic Crisis on Infinite Earths. That fails, as does his attempts with other characters, including Linda Park, the woman who was his wife in the pre-Flashpoint universe. He recognizes that she, as well as himself and everyone around him, is younger, as 10 years of their lives were stolen from them. He realized that if his own wife doesn’t even know who he is, it’s useless. Basically, he makes peace with his impending death and chooses to go into the next life.</p>\n<p>He makes one last stop to say goodbye to the Flash, Barry Allen—the man who served as his mentor and father figure—which is where the worm turns. In a 12-page sequence drawn by Phil Jimenez (in some of the best pages he’s ever rendered), Barry suddenly remembers Wally, and draws him out of the Speed Force and back into reality. As the two embrace, Barry cries and says, “How could I ever forget you?” I can tell you, this longtime DC reader was crying alongside him. Although the artwork is solid all the way around in this comic, with pages alternating between pencillers also including Ivan Reis, Ethan Van Sciver, and Gary Frank, it is Jimenez who shines the most. Having said that, all the artists in this book are really on their A-game for this one.</p>\n<p><img src=\"https://nerdist.com/wp-content/uploads/2016/05/Barry-Wally.jpg\" alt=\"Two\"></p>\n<p>Wally then explains to Barry that something else is behind the changes in their reality, behind the 10 years of stolen time. It wasn’t Barry’s fault with the Flashpoint—someone more powerful used the Flashpoint event as a way to rewrite the heroes of the DC Universe’s histories, to take away their friendships and relationships, to take away the glue that held them all together. This being, Wally says, is more powerful than Darkseid, more powerful than anyone they had ever faced.</p>\n<p>As it turns out, the biggest reveal is saved for the end of the book, when it’s shown that the being who has been manipulating the DCU these past few years is none other than Dr. Manhattan, from Alan Moore’s Watchmen. Now, Watchmen is as as sacred a cow as you’re going to get in comics. Since it was first published, it’s always existed as a self-contained story outside the DC Universe; aside from the Before Watchmen comics a few years back, no one has dared touch that story, much less incorporate its events into the greater DC Multiverse. Well, Dan DiDio said that DC Rebirth would hold the most shocking thing DC had ever done. Turns out, he wasn’t kidding.</p>\n<p><img src=\"https://nerdist.com/wp-content/uploads/2016/05/wally-reveal-183491.jpg\" alt=\"Three\"></p>\n<p>The reveal that Dr. Manhattan is the mega-powerful force puppeteering the New 52 may offend many, including Alan Moore, who I’m sure will have only not very nice things to say about everyone at DC for doing this. But it’s also a really ballsy move, and one for which the meta commentary extends even further. Ever since Watchmen was first published in 1986, DC has been chasing that book’s success, trying to “gritty up” their mainstream DC Universe in an effort to reflect the world of Watchmen. The New 52 was the ultimate expression of that. But no matter how great a work it is, Watchmen wasn’t meant to be reflected in the DC Universe, because at its core, the DCU is a bright and hopeful place where optimism wins out. Watchmen was meant to show how in the real world, superheroes can’t exist. But the DCU isn’t our world—it’s a better one. And it should remain that way.</p>\n<p>DC Rebirth is filled with other big revelations, and a lot of setup for storylines that will play out in other comics over the course of the next few years. We have the reveals that the Justice Society of America did indeed exist in World War II, but were wiped from memory. We get the reintroduction of character like the Atom and Blue Beetle, once again showing them as legacy characters ready to pass on their mantles to a newer generation. There are very interesting hints about the Superman of the DCU, and how they aren’t exactly what we think they are. No, Rebirth doesn’t “undo” the New 52, but it places it in a greater context, a part of the seven-decade history of the DC Universe. It admits things need to be fixed, and begins the process of fixing them. What more can we ask for?</p>\n<p>Geoff Johns and company have created a small miracle with Rebirth, and it’s a shame that it will be his last comic book work for a while (Johns is off to do for the DC movie universe what he’s done for the comics: bring back optimism and hope. I wish him all the luck). The final two-page spread by Ivan Reis for Rebirth shows the heroes of the DCU posed heroically, and more importantly, smiling. That image sums this book up in a nutshell. How much mileage you get out of this comic depends on how invested you are in the DC Universe, but this fan is really excited for what comes next.</p>","id":"a29ab7fc-1c4a-5dbd-ad27-07851bb61b92","frontmatter":{"date":"2018-05-23T12:34:00+00:00","path":"/news/test-post","title":"Test Post","excerpt":"It all begins here. Do not skip to the last page. Do not let a friend or message board ruin this comic for you. The future (and past) of the DC Universe starts here. Don’t say I didn’t warn you!","tags":["The Flash","Batman","Superman","Wally West","Wonder Woman","DC"]}}],"tagName":"Wonder Woman"}}