{"pageContext":{"posts":[{"html":"<h2>Article Highlights</h2>\n<ul>\n<li>A new feature on the LDS Tools app and LDS.org lets you send referrals directly to missionaries.</li>\n<li>LDS.org/referrals is available in 28 languages.</li>\n</ul>\n<h2>Related Links</h2>\n<ul>\n<li><a href=\"https://www.lds.org/referrals/?lang=eng\">Submit a referral to the missionaries at lds.org/referrals.</a></li>\n<li><a href=\"https://content.ldschurch.org/bc/content/missionary-referral/pdf/member-referral-experience-eng.pdf\">Learn more with this downloadable presentation.</a></li>\n<li><a href=\"https://www.lds.org/referrals/?lang=eng\">Watch a video about sharing the gospel.</a></li>\n</ul>\n<p>The Church has implemented a new way to help members and missionaries work together more effectively to help people come unto Christ.</p>\n<p>A new feature on <a href=\"https://www.lds.org/pages/mobileapps?lang=eng\">LDS Tools</a> and <a href=\"https://www.lds.org/referrals/send?lang=eng\">LDS.org</a> lets you send referrals directly to missionaries and collaborate with them as they contact and teach your friend. Once you obtain your friend's permission to be contacted, no matter where you and your friend live---even if you're far apart---when you submit a name to the missionaries, you can:</p>\n<ul>\n<li>Be part of the process by helping the missionaries understand your friend's needs, interests, questions, and preferred method of communication. After submitting your friend's contact information, you will see contact information for the missionaries, bishop, and ward mission leader where your friend lives.</li>\n<li>Participate in missionary lessons or gospel discussions in person or through phone or video chat. You can be as involved in teaching your friend as you want to be.</li>\n<li>Follow up with your friend between missionary appointments to answer questions and provide support.</li>\n</ul>\n<p>Watch the video on <a href=\"https://www.lds.org/referrals/?lang=eng\">lds.org/referrals</a> called \"<a href=\"https://www.lds.org/referrals/?lang=eng\">Share the Gospel with a Friend</a>\" to see more about this approach with members and missionaries working together.</p>\n<p>While serving as a missionary in the Oregon Salem Mission, Sister Carly Plowman from Thornton, Colorado, realized how important it is to share the gospel with her own family and decided to use the referral system to send the missionaries to her grandfather.</p>\n<p><img src=\"https://www.lds.org/bc/content/ldsorg/church/news/2018/01/29/620-referral%20image%201%20copy.png#outsetRight\"></p>\n<p><img src=\"https://www.lds.org/bc/content/ldsorg/church/news/2018/01/29/620referral%20image%202%20copy.png#outsetRight\"></p>\n<p>She heard back from the missionaries quickly, and her grandfather has been taught the Restoration lesson. She is looking forward to the possibility to Skype in on a lesson. \"It would be a lot more personal,\" she said. \"He would have a better connection to it because I would be there.\"</p>\n<p>Sister Plowman and her companion also have received a referral through the new process. \"This way, you know that if [the referral is] sent by someone, then there might be more potential. And you have a way to contact someone as a point of reference. Something else that I think is really helpful is that if that person lives in that area who contacted you, they could come with you,\" she said.</p>\n<p>While working as a door-to-door salesman in San Diego, California, Dallin Pancheri met a woman named Erlinda. When she found out he had learned Spanish from serving mission in Colombia, their discussion led to the gospel and he offered to send some representatives from the Church who could talk more with her.</p>\n<p>As Dallin pulled up the LDS Tools app on his phone to locate a nearby LDS meetinghouse, he discovered he could submit a referral right from the app. He did so, and when the missionaries contacted him later, Dallin explained to them how he met Erlinda.</p>\n<p>\"The Spirit definitely touched me, and it was a nice little reminder of how great the missionary effort is,\" he said. \"It's nice to know that the Church is coming up with ways to make it easier to spread the word and really allow every ear to hear the word of Christ and the message of the restored gospel,\" he said.</p>\n<p><a href=\"https://www.lds.org/referrals/?lang=eng\">LDS.org/referrals</a> is available in 32 languages. Watch the <a href=\"https://content.ldschurch.org/bc/content/missionary-referral/pdf/member-referral-experience-eng.pdf\">presentation</a> that explains the new missionary referral process in more detail.</p>","id":"e99bcf2a-d283-52c9-858f-26ea7b0c8dff","frontmatter":{"date":"2018-06-09T12:34:00+00:00","path":"/news/a-new-way-to-refer-a-friend-to-missionaries","title":"A New Way to Refer a Friend to the Missionaries","excerpt":"Sacred music teaches the doctrines of the gospel, nourishes us spiritually, and has the power to unify Church members throughout the world. The Church has announced it is revising the hymnbook and children’s songbook and invites members to participate.","tags":["Technology","Missionary Work"],"image":"https://www.lds.org/bc/content/ldsorg/church/news/2018/01/29/580-1191048-PS131220_cah_0479.jpg"}}],"tagName":"Missionary Work"}}